
/**
 * jQuery format - v1.0
 *
 */

(function( $, undefined ) {

	$.lily.param = $.lily.param || {};
	$.lily.busName = $.lily.busName || {};
	/*$.lily.ajax({
        url: $.lily.getContextPath()+'/pubApp.do',
        type: 'post',
        data : {
			'session_language' : 'ZH_CN'
		},
        async: false
    }).done(function(data) {
    	var col = data.appList;
    	var menu = data.iBusinessMenu;
    	$.each(col, function() {
    		var appValue=this.appValue;
    		var appMes=this.appMes.substring(1,this.appMes.length-1);
    		var mesMap=appMes.split(",");
    		var map={};
    		$.each(mesMap, function(i) {
    			var key=$.trim(this.split("=")[0]);
    			var value=$.trim(this.split("=")[1]);
    			map[key]=value;
    		});
    		$.lily.param[appValue]=map;
    	});
    	$.each(menu, function() {
    		var appValue=$.trim(this.businessCode);
    		var appMes=$.trim(this.businessName);
    		$.lily.busName[appValue]=appMes;
    	});
    });*/

	$.extend( $.lily.param, {

		/*BANK_TYPE: {
			'102':'中国工商银行'  ,
			'103':'中国农业银行'  ,
			'104':'中国银行'  ,
			'105':'中国建设银行'  ,
			'201':'国家开发银行'  ,
			'202':'中国进出口银行'  ,
			'203':'中国农业发展银行'  ,
			'301':'交通银行'  ,
			'302':'中信实业银行'  ,
			'303':'中国光大银行'  ,
			'304':'华夏银行'  ,
			'305':'中国民生银行'  ,
			'306':'广东发展银行'  ,
			'307':'深圳发展银行'  ,
			'308':'招商银行'  ,
			'309':'兴业银行'  ,
			'310':'上海浦东发展银行'  ,
			'313':'城市商业银行'  ,
			'315':'恒丰银行'  ,
			'316':'浙商银行'  ,
			'401':'城市信用合作社'  ,
			'402':'农村信用合作社'  ,
			'403':'国家邮政局邮政储汇'  ,
			'501':'汇丰银行'  ,
			'502':'东亚银行'  ,
			'503':'南洋商业银行'  ,
			'504':'恒生银行'  ,
			'505':'中国银行（香港）有限公司'  ,
			'506':'集友银行有限公司'  ,
			'509':'星展银行（香港）有限公司'  ,
			'510':'永亨银行有限公司'  ,
			'531':'美国花旗银'  ,
			'532':'美国银行有限公司'  ,
			'561':'日本东京三菱银行'  ,
			'562':'日本日联银行'  ,
			'563':'日本三井住友银行'  ,
			'564':'日本瑞穗实业银行'  ,
			'565':'日本山口银行'  ,
			'591':'韩国外换银行'  ,
			'593':'韩国友利银行'  ,
			'594':'韩国产业银行'  ,
			'596':'韩国中小企业银行'  ,
			'623':'新加坡星展银行'  ,
			'651':'比利时联合银行'  ,
			'661':'荷兰银行有限公司'  ,
			'671':'英国渣打银行'  ,
			'693':'法国东方汇理银行股份有限公司'  ,
			'694':'法国东方汇理银行股份有限公司'  ,
			'711':'德国德累斯登银行'  ,
			'712':'德意志银行'  ,
			'713':'德国商业银行'  ,
			'741':'瑞士信贷第一波士顿银行'  ,
			'761':'澳大利亚和新西兰银行集团'  ,
			'781':'厦门国际银行'  ,
			'782':'法国巴黎银行（中国）有限公司'  ,
			'783':'平安银行有限责任公司'  ,
			'787':'华一银行'  ,
			'901':'中央国债登记结算有限责任公司'  ,
			'902':'公开市场业务操作室'  ,
			'903':'中国外汇交易'  ,
			'904':'城市商业银行资金清'  ,
			'905':'中国银联股份有限公司'  ,
			'969':'(澳门地区)'  ,
			'989':'(香港地区)'
		},

		CUSTOMER_CERT_TYPE:{
			'01' : '身份证 ',
			'02' : '军官证',
			'03' : '户口簿',
			'04' : '护照',
			'05' : '回乡证',
			'06' : '警官证',
			'07' : '临时身份证',
			'08' : '文职干部证',
			'49' : '其他（对私)',
			'51' : '企业代码证',
			'52' : '营业执照',
			'53' : '登记证书',
			'54' : '批文',
			'55' : '开户证明',
			'99' : '其他(对公)'
		},

		CERT_TYPE: {
			'1': '身份证' ,
			'2': '学生证' ,
			'3': '军官证' ,
			'4': '港澳台通行证' ,
			'5': '护照' ,
			'6': '其他'
		},
		//审核状态（已补充成功、待补充、待审核、审核不成功不能补充）
		AUDIT_STAT: {
			'0': '已补充成功' ,
			'1': '待补充' ,
			'2': '待审核' ,
			'3': '审核不成功不能补充'
		},
		//补充值申请交易类型
		AUDIT_TXNTYPE: {
			'51': '账户圈存' ,
			'56': '刮刮卡圈存'
		},
		//基金证件类型
		FUND_CERT_TYPE: {
			'0': '身份证' ,
			'1': '军官证' ,
			'2': '户口簿' ,
			'3': '护照' ,
			'20': '警察证' ,
			'20': '港澳通行证' ,
			'20': '外国人居留证'
		},
		CREDIT_CERT_TYPE: {
			'01': '身份证' ,
			'20': '外国人居留证'
		},
		//基金签约状态
		FUND_STATE: {
			'0': '已签约' ,
			'1': '未签约'
		},

		//基金账户状态
		FUND_ACCOUNT_STATE: {
			'0': '已开户' ,
			'1': '预开户'
		},

		AUTO_TRANSFER_FLAG_TYPE: {
			'0': '是',
			'1': '否'
		},
　//账户状态
		ACCOUNTNO_STATE_TYPE: {
			'0': '正常',
			'1': '',
			'2': '挂失',
			'3': '临时冻结',
			'4': '永久冻结',
			'5': '撤销'
		},
		　//用户状态
		USER_STATE_TYPE: {
			'0': '正常',
			'2': '临时冻结',
			'4': '永久冻结',
			'5': '撤销'
		},

		CHANNEL_TYPE: {
			'01' :'网上银行',
			'02' : '手机银行'
		},

		 * 手续费缴纳方式

		DEDUCTTYPE: {
			'0' :'卡内余额缴纳',
			'1' : '积分抵扣',
			'2' : '套餐抵扣',
			'3' : '积分抵扣',
			'4' : '免手续费'
		},

		 * 积分来源

		INTEGRAL_FROM: {
			'1' :'交易赠送',
			'2' : '手续费抵扣'
		},
		creadit_subFlag: {
			'0' :'无附属卡',
			'1' : '有附属卡'
		},

		CURRENCY_TYPE: {
			'CNY':'人民币',
			'USD': '美元' ,
			'HKD': '港币' ,
			'EUR': '欧元' ,
			'JPY': '日元' ,
			'RUB': '卢布' ,
			'GBT': '英镑'
		},
		CURRENCY_TYPE_CODE: {
			'01':'人民币',
			'14': '美元' ,
			'13': '港币' ,
			'38': '欧元' ,
			'27': '日元' ,
			'16': '卢布' ,
			'12': '英镑' ,
			'18': '新加坡元',
			'28': '加元',
			'29': '澳元',
			'87': '新西兰元'
		},
		DEBITCREDIT_DERECTION:{
			'0':'转入',
			'1': '转出'

		}
		,
		DESPOSIT_TYPE:{
			'202':'活期账户',
			'206':'定活两便',
			'207': '通知存款',
			'211': '定期账户',
			'214': '零存整取',
			'218': '存本取息'
		},
		SAVING_PERIOD_TYPE:{
			'00':'活期',
			'03':'三个月',
			'06':'六个月',
			'12':'一年',
			'24':'两年'	,
			'36':'三年',
			'60':'五年'

		},
		CURRIDEN_TYPE:{
			'0':"现钞",
		    '1':"汇款"
		},
		PAY_TYPE:{
			'T':"全额",
		    'M':"最小还款额",
		    'F':"固定金额",
		    'P':"按百分比金额"
		},
		SUBCARD_TYPE:{
			'':"正常",
			'A':"卡片未激活",
		    'B':"银行止付卡片",
		    'C':"发卡行关闭账户",
		    'D':"冻结账户",
		    'E':"银行停用离行员工卡片",
		    'F':"欺诈",
		    'H':"账户止付",
		    'I':"测试挂失",
		    'K':"商务卡卡片丢失",
		    'L':"卡片丢失",
		    'M':"邮件退回",
		    'N':"未收到卡片",
		    'O':"因逾期而停用卡片",
		    'P':"拣到的卡片挂失",
		    'PQ':"内部关帐专用(禁用)",
		    'Q':"持卡人请求关闭",
		    'S':"被偷",
		    'T':"销卡代码",
		    'U':"睡眠卡关闭",
		    'V':"新卡激活,旧卡失效",
		    'X':"停计息费",
		    'Y':"损坏交回",
		    'Z':"持卡人死亡"
		},
		BILLADDRESS_FLAG:{
			'H':"家庭",
		    'B':"公司",
		    'F':"户籍",
		    'W':"房产"
		},
		//信用卡交易状态
		NOBILL_FLAG:{
			'': "交易成功",
		    '0':"交易成功",
		    '1':"交易失败"
		},
		//信用卡申请流程状态
		CC_APPLY_FLOW:{
			'1': "操作成功",
		    '2': "操作失败",
		    '3': "操作异常"
		},
		//信用卡申请流程节点
		CC_APPLY_FLOWNAME:{
			'00701500': "信用卡申请",
		    '00701502': "信用卡申请初审",
		    '00701501': "信用卡申请修改",
		    '00701503': "信用卡申请授信",
		    '00701504': "信用卡申请真实性审核",
		    '00701505': "信用卡申请制卡"
		},
		//信用卡申请流程审批状态
		CC_APPLY_FLOW_STATE:{
			'1': "审批通过",
		    '0': "审批拒绝"
		},
		//信用卡已出账单币种
		BILL_CURRENCY_TYPE:{
			'156':'人民币',
			'840': '美元',
			'L': '人民币',
			'A': '人民币',
			'01':'人民币'
		},
		//信用卡密码类型
		PWD_TYPE:{
			'2': '取现密码',
			'3': '查询密码'
		},
		//信用卡还款方式
		REPAY_TYPE:{
			'T':'全额',
			'M': '最低还款额'
		},
		//信用上传资料类型
		CREDITCARD_FILETYPE:{
			'':	'其他资料',
			'1': '身份证'
		},
		//自动还款设置状态
		AUTOPAY_TYPE:{
			'Y':'已设置',
			'N': '未设置',
			'2':'修改自动还款信息',
			'3':'新增自动还款信息'
		},
		//信用卡分期付款标志
		MP_TYPE:{
			'':'非分期付款',
			'1': '分期付款',
			'0': '非分期付款'
		},
		certType: {	//核心证件类型
				'01': '身份证 ' ,
				'02': '军官证' ,
				'03': '户口簿' ,
				'04': '警官证' ,
				'05': '解放军士兵证' ,
				'06': '护照' ,
				'07': '港澳台居民通行证' ,
				'08': '解放军文职干部证' ,
				'16': '解放军离休干部荣誉证' ,
				'24': '军官退休证' ,
				'25': '文职干部退休证' ,
				'26': '军事院校学员证' ,
				'31': '武警士兵证' ,
				'33': '武警文职干部证' ,
				'34': '武警军官退休证' ,
				'35': '武警文职干部退休证' ,
				'52': '营业执照' ,
				'99': '其他(对公)'
		},
		//信用卡激活身份证
		CCACTIVE_CERT_TYPE: {
			'01': '身份证' ,
			'02': '身份证' ,
			'03': '军官证' ,
			'04': '台胞证' ,
			'10': '护照',
			'20': '其它'
		},
		//信用卡积分冻结标志
		FREEZEPOINTS_FLAG: {
			'': '正常' ,
			'F': '冻结'
		},
		//信用卡申请证件类型
		CREDITCARD_IDCARD: {
			'01': '身份证' ,
			'03': '军官证' ,
			'04': '台胞证' ,
			'05': '回乡证' ,
			'10': '护照',
			'06': '港澳通行证'
		},
		//信用卡激活证件类型（日志用）
		CC_CERT_TYPE: {
			'01': '身份证' ,
			'03': '军官证' ,
			'04': '台胞证' ,
			'05': '回乡证' ,
			'10': '护照',
			'06': '港澳通行证'
		},
		//信用卡申请用婚姻状况
		MARRAY_FLAG: {
			'S': '未婚',
			'M': '已婚' ,
			'0': '其它'
		},
		//信用卡申请子女状况
		CREDITCARD_CHILDSTAUS: {
			'1': '有',
			'2': '无'
		},
		//信用卡申请教育程度
		CREDITCARD_TEACH: {
			'1': '初中及以下',
			'2': '中专、高中',
			'3': '大专',
			'4': '本科',
			'5': '硕士',
			'6': '博士'
		},
		//信用卡申请用--房屋状况
		HOUSE_STATE: {
			'1': '与亲属合住' ,
			'2': '租用' ,
			'3': '自购无贷款' ,
			'4': '自购有贷款',
			'5': '单位分配' ,
			'6': '其它'
		},
		//信用卡申请用--职务
		CREDITCARD_DUTIES: {
			'01': '厅局级以上' ,
			'02': '处级' ,
			'03': '科级' ,
			'04': '一般干部',
			'11': '企业负责人' ,
			'12': '中层管理人员',
			'13': '一般管理人员',
			'14': '一般员工' ,
			'15': '其它'
		},
		//信用卡申请用--职称
		CREDITCARD_userJob: {
			'1': '高级' ,
			'2': '中级' ,
			'3': '初级' ,
			'4': '其它'
		},
		//信用卡申请用--职称
		CREDITCARD_RELATION: {
			'1': '配偶' ,
			'2': '子女' ,
			'3': '父母' ,
			'4': '兄弟姐妹'
		},
		//公司性质
		PROPERTIES: {
			'01': '政府机关/事业单位' ,
			'02': '国有企业' ,
			'03': '独资企业' ,
			'04': '合资/合作企业',
			'05': '股份制企业' ,
			'06': '私营企业',
			'07': '其他'
		},
		//哈行客户
		CSTTYPE: {
			'1': '借记卡客户' ,
			'2': '其他存款户' ,
			'3': '个人贷款户' ,
			'4': '代发工资户',
			'5': '对公往来户',
			'6': '其它'
		},
		//账户类型
		PB_ACC_TYPE: {
			'01':'借记卡',
			'08':'贷记卡（信用卡）',
			'05':'普通存折',
			'03':'活期一本通'
		},
		//风险类型
		PERBANK_RISKLEVEL:{
			'00':'低'
		},
		//签约渠道
		CHANNELFLAG: {
			'1101': '网上签约' ,
			'1': '网上签约' ,
			'1100': '柜台签约' ,
			'1201': 'WAP签约'
		},
		//信用卡申请类型
		APPLYTYPE: {
			'1': '主卡' ,
			'2': '附属卡',
			'3': '主卡和附属卡'
		},
		//信用卡申请卡种
		CREDITCARD_KIND: {
			'0003': '银联金卡',
			'0001': '银联普卡'
		},
		//信用卡申请-附属卡额度标志
		CREDITCARD_LIMITFLAG: {
			'': '未设置',
			'1': '固定额度',
			'2': '占主卡额度百分比'
		},
		//信用卡申请性别
		CREDITCARD_SEX: {
			'M': '男',
			'F': '女'
		},
		//信用卡申请国籍
		CREDITCARD_COUNTRY: {
			'1': '境内',
			'2': '境外',
			'3': '港澳',
			'4': '台胞'
		},
		//信用卡种类型，进度查询
		PLAN_CARDTYPE: {
			'0001': '银联个人普卡',
			'0002': '员工白金卡',
			'0003': '银联个人金卡',
			'0004': '员工普卡',
			'0005': '省级预算公务员金卡',
			'0006': '员工金卡'
		},
		//申请进度主附卡标志
		PLAN_MAINORSUB: {
			'1': '主卡' ,
			'2': '附属卡',
			'3': '附属卡',
			'4': '附属卡',
			'5': '附属卡',
			'6': '附属卡',
			'7': '附属卡',
			'8': '附属卡',
			'9': '附属卡'
		},

		//信用卡申请状态（银联）
		CCAPPLY_STATE: {
			'10': '录入',
			'20': '文件审核',
			'30': '补件',
			'40': '潜在风险',
			'50': '异常申请',
			'60': '信用审核',
			'70': '拒绝',
			'80': '取消',
			'90': '已核准',
			'99': '已产生卡片'
		},
		//信用卡申请状态(网银）
		CCAPPLY_STATE_TRACK: {
			'0': '审核中',
			'1': '审核中',
			'2': '资料欠缺',
			'3': '申请失败',
			'4': '真实性审核',
			'5': '申请失败',
			'6': '制卡',
			'7': '申请失败',
			'8': '申请失败',
			'9': '初审通过',
			'10': '补全资料',
			'40': '潜在风险',
			'50': '异常申请',
			'60': '信用审核',
			'70': '拒绝',
			'80': '取消',
			'90': '已核准',
			'99': '已产生卡片'
		},
		//待办事项状态
		WORKAPPLY_STATE: {
			'0': '未办理',
			'1': '已办理'
		},

		REG_SIGN_FLAG:{
			'0':'开户',
			'1':'登记'
		},
		SENDFREQ_FLAG:{
			'1':'不寄送',
		    '2':'按月',
		    '3':'按季',
		    '4':'半年',
		    '5':'一年'
		},
		TABMOD_FLAG:{
			'00010000':'短消息',
			'00100000':'E-mail',
			'01000000':'传真',
			'10000000':'邮寄'
		},
		//理财方程式存款类型
		EQUATION_BIZKIND_FLAG: {
			'10803': '理财方程式'
		},

		//转存类型
		EQUATION_ROLLTYP_FLAG:{
			'7':'活期转理财方程式'
		},
		//转存有效标志
		EQUATION_ROLLFLAG_FLAG:{
			'0':'有效',
			'1':'无效'
		},
		//跨行转账类型
		EXTERNAL_TRANSFER_TYPE: {
			'1': '实时转账',
			'2': '快速转账',
			'0': '行内转账'
		},
		//默认分红方式
		FUND_DIVMOD_FLAG:{
			'0': '红利再投资',
			'1': '现金分红'
		},
		//允许分红方式
		FUND_DIVMODS_FLAG:{
			'0': '红利再投资',
			'1': '现金分红',
			'01': '红利再投资,现金分红'
		},
		//转换标志
		FUND_CONVFLG_FLAG:{
			'0':'可转入,可转出',
			'1':'只可转入',
			'2':'只可转出',
			'3':'不可转换'
		},
		//产品类型
		FUND_PRODTYPE_FLAG:{
			'0':'基金',
			'1':'国内理财产品',
			'2':'境外理财产品'
		},
		//币种
		FUND_CCY_FLAG:{
			'156':'人民币'
		},
		//基金状态
		FUND_STATUS_FLAG:{
			'0':'开放期',
			'1':'募集期',
			'2':'发行成功',
			'3':'发行失败',
			'4':'停止交易',
			'5':'停止申购',
			'6':'停止赎回',
			'7':'权益登记',
			'8':'红利发放',
			'9':'产品封闭期',
			'a':'产品终止',
			'b':'预约认购期'
		},
		//基金产品风险级别
		FUND_PRODRISKLVL_FLAG:{
			'0':'未评定',
			'1':'低风险',
			'2':'中低风险',
			'3':'中等风险',
			'4':'中高风险',
			'5':'高风险'
		},
		//客户风险级别
		FUND_MEMBERRISKLVL_FLAG:{
			'0':'未评定',
			'1':'保守型',
			'2':'稳健型',
			'3':'平衡型',
			'4':'成长型',
			'5':'进取型'
		},
		//客户风险级别 返现
		FUND_RISKLVL_FLAG:{
			'未评定':'0',
			'保守型':'1',
			'稳健型':'2',
			'平衡型':'3',
			'成长型':'4',
			'进取型':'5'
		},
		FUND_PRODATTR_FLAG:{
			'0':'货币市场基金',
			'1':'债券基金',
			'2':'混合型基金',
			'3':'股票型基金',
			'5':'QDII基金'
		},
		PBK_CHANNEL_FLAG:{
			'0':'行内',
			'1':'跨行实时',
			'2':'跨行快速'
		},
		APP_CHANNEL_FLAG:{
			'00':'内管中心',
			'01':'会员中心',//个人会员中心
			'02':'会员中心',//企业会员中心
			'03':'手机wap',
			'04':'网上营业厅',//
			'06':'快捷服务区' //
		    '1100':'内管中心',
			'1101':'个人会员中心',
			'1102':'个人网上营业厅',
			'1103':'企业会员中心',
			'1104':'企业网上营业厅',
			'1105':'个人快捷区',
			'1201':'手机WAP',
			'1301':'手机客户端',
			'1701':'IPAD版网银',
			'2101':'IVR',
			'2102':'CSR',
			'2201':'移动柜员系统',
			'2301':'电视银行（家居银行）',
			'2401':'短信银行',
			'2501':'微信银行',
			'3101':'刷卡',
			'3102':'输卡号'
		},
		ADDVALUE_CHANEL_FLAG:{
			'1101':'PC渠道',
			'1201':'手机WAP',
			'0000':'全渠道'
		},
		FUND_LARGREDFLG_FLAG:{
			'0':'取消',
			'1':'顺延'
		},
		FUND_ENDMOD_FLAG:{
			'0':'投资期数',
			'1':'终止日期',
			'2':'成功期数'
		},
		FUND_PERD_FLAG:{
			'0':'月'
		},
		tranSfer_flag:{//跨行转账状态
			'90':'交易成功',//账务成功
			'99':'交易已提交',//核心未返回
			'95':'交易处理中',//已成功提交
			'92':'交易失败',//人行返回失败
			'91':'交易失败',//核心返回失败
			'50':'交易异常'
		},

		 * 二代支付转账查询状态（本行转他行）

		realTimeExter_flag:{
			'PR00':'处理中',
			'PR01':'处理中',
			'PR02':'处理中',
			'PR03':'交易成功',
			'PR04':'交易成功',
			'PR05':'交易成功',
			'PR06':'交易处理中',
			'PR07':'交易处理中',
			'PR08':'交易失败',
			'PR09':'交易失败',
			'PR10':'交易处理中'
		},


		 * 网银互联人行状态

		REALTIME_FLAG:{
			'PR00':'已转发',
			'PR01':'待认证',
			'PR02':'已付款',
			'PR03':'已轧差',
			'PR04':'已清算',
			'PR05':'已成功',
			'PR06':'待处理',
			'PR07':'已处理',
			'PR08':'已撤销',
			'PR09':'已拒绝',
			'PR10':'已确认'
		},
		card_flag:{//卡折标识
			'1':'卡',//卡
			'0':'折'
		},

		//是否可提前支付(国债)
		isAdvanceExchange:{
			'1' :　'是' ,
			'0' : '否'
		},
		//账户类别
		ACCOUNT_TYPE:{
			'0' :　'本行',
			'1' : '他行'
		},
		User_Gender:{
			'M' :　'男',
			'F' : '女'
		},
		TRANDEVTYPE_FLAG:{
			'00':"账务主机",
			'01':"ATM/CDM/CRS",
			'02':"ATM/CDM/CRS",
			'03':"POS",
			'04':"ATM/CDM/CRS",
			'05':"ATM/CDM/CRS",
			'06':"柜面",
			'07':"网银",
			'08':"手机银行",
			'09':"电话银行",
			'10':"其他",
			'11':"POS",
			'12':"柜面",
			'13':"ATM/CDM/CRS",
			'14':"POS",
			'15':"ATM/CDM/CRS",
			'16':"电话银行",
			'17':"网银",
			'W0':"新网银平台",
			'S0':"手机WAP",
			'18':"手机银行",
			'19':"ATM/CDM/CRS",
			'20':"电话银行",
			'21':"ATM/CDM/CRS",
			'22':"POS",
			'23':"ATM/CDM/CRS",
			'24':"POS",
			'25':"ATM/CDM/CRS",
			'26':"ATM/CDM/CRS",
			'27':"ATM/CDM/CRS",
			'28':"支付系统",
			'29':"柜面",
			'30':"国际结算",
			'31':"银联数据（贷记卡）",
			'32':"POS",
			'33':"POS",
			'34':"ATM/CDM/CRS",
			'35':"POS",
			'36':"ATM/CDM/CRS",
			'37':"POS",
			'38':"ATM/CDM/CRS",
			'39':"POS",
			'40':"ATM/CDM/CRS",
			'41':"POS",
			'42':"银联公共服务平台",
			'43':"ATM/CDM/CRS",
			'44':"ATM/CDM/CRS",
			'45':"ATM/CDM/CRS",
			'46':"ATM/CDM/CRS",
			'47':"ATM/CDM/CRS",
			'48':"ATM/CDM/CRS",
			'49':"ATM/CDM/CRS",
			'50':"ATM/CDM/CRS",
			'51':"POS",
			'52':"POS",
			'53':"POS",
			'54':"POS",
			'55':"POS",
			'56':"POS",
			'57':"POS",
			'58':"POS",
			'59':"ATM/CDM/CRS",
			'60':"POS",
			'61':"POS",
			'63':"其他",
			'65':"其他",
			'66':"其他",
			'67':"其他",
			'68':"其他",
			'80':"信贷",
			'82':"微贷",
			'83':"国结",
			'84':"财务",
			'85':"电子回单柜",
			'86':"理财管理系统",
			'87':"电票",
			'88':"网银",
			'9A':"村镇网银",
			'91':"其他",
			'92':"其他",
			'94':"其他",
			'97':"中间业务",
			'98':"中间业务",
			'99':"其他"
			},

		//时间类型
		DateType_Code:{
			'D' : '天',
			'M' : '月',
			'Y' : '年',
			'd' : '天',
			'm' : '月',
			'y' : '年',
			'日' : '天',
			'月' : '月',
			'年' : '年',
			'R' : '其他'
		},

		//风险级别
		Risk_Level_Type: {
			'01':'一级',
			'02':'二级',
			'03':'三级',
			'04':'四级',
			'05':'五级',
			'06':'六级'
		},

		//风险级别+描述
		Risk_Type_Info: {
			'01':'一级（低级风险）',
			'02':'二级（低风险）',
			'03':'三级（中等风险）',
			'04':'四级（较高风险）',
			'05':'五级（高风险）',
			'06':'六级（极高风险）'
		},

		//账户类型（网银互联）
		ACC_TYPE:{
			'AT00':'单位银行结算',
			'AT01':'借记卡（存折）',
			'AT02':'贷记卡'
		},
		//风险级别反匹配
		Risk_Level_ReversalType: {
			'一级' : '01',
		    '二级' : '02',
			'三级' : '03',
			'四级' : '04',
			'五级' : '05',
			'六级' : '06'
		},

		//常用功能bsncode 对应 action
		BSNDEF_ACTION: {
			'00000000':'00000000_register',
			'00000200':'007002_centerPasswordModify',
			'00000501':'00000501_accountManage',
			'00100000':'00100000_accountList',
			'00100200':'00100200_accountLost',
			'00200000':'00200000_singleTransferIndexView',
			'00200101':'00200101_terminalToCurrentOverview',
			'00300000':'00300000_transfer',
			'00300105':'00300100_externalTransfer',
			'00300106':'00300200_externalTransferQuery',
			'00300107':'00300107_noConditionTransfer',
			'00300300':'00300300_recBook',
			'00400000':'00400000_accountDebitTranDetail',
			'00400100':'00400100_logQuery',
			'00500000':'00500000_centerPasswordModify',
			'00500100':'00500100_applicationForbidMenu',
			'00500200':'00500200_preSettingMessageUpdate',
			'00500300':'00500300_businessForbidMenu',
			'00500400':'00500400_spaPwdModify',
			'00500500':'00500500_limitSetting',
			'00500600':'00500600_certModify',
			'00500700':'00500700_privateQuestionUpdate',
			'00500800':'00500800_payPwdModify',
			'00600000':'00600000_loanAccountList',
			'00700000':'00700000_creditCardIntegral',
			'00700100':'00700100_creditCardManage',
			'00700200':'00700200_noEmergeBill',
			'00700300':'00700300_emergeBill',
			'00700500':'00700500_autoRepayment',
			'00700600':'00700600_creditCardPlan',
			'00700700':'00700700_cCIntegralDetail',
			'00700800':'00700800_creditCardMessageManage',
			'00701000':'00701000_creditCardActivate',
			'00701100':'00701100_creditCardLoss',
			'00701200':'00701200_creditCardAboutPwd',
			'00701300':'00701300_handRepayment',
			'00701500':'00701500_creditCardApply',
			'00800000':'00800000_feePayment',
			'00700001':'00700001_myCreditCardBill',
			'00700002':'00700002_myCreditCardPay',
			'00700005':'00700005_myCreditCardManage',
			'00900000':'00900000_govermentLoanBuyHand',
			'00900100':'00900100_govermentLoanExchange',
			'00900200':'00900200_governmentloanQuery',
			'01000000':'01000000_lilacBuy',
			'01000100':'01000100_finacingProduct',
			'01000200':'01000200_unBuylilacProduct',
			'01000400':'01000400_lilacManageIndexOverview',
			'01100201':'01100201_myPayProtocol',
			'01100301':'01100301_myQueryProtocol',
			'01200000':'01200000_queryAllFund',
			'01200001':'01200001_queryHoldFund',
			'01200002':'01200002_fundAppandTrust',
			'01200003':'01200003_fundHisTrade',
			'01200202':'01200200_stopFixTMFund',
			'01200005':'myFundIndex',
			'01200006':'myBuyFundIndex',
			'01200100':'01200100_buyFund',
			'01200101':'01200101_ransomFund',
			'01200102':'01200102_changeFund',
			'01200103':'01200103_changeSOB',
			'01000405':'equation',
			'01200200':'01200200_changeFixTMFund',
			'01200201':'01200201_fixTMFund',
			'01200300':'01200300_fundAccManagerIndex',
			'01200400':'01200400_risk_check',
			'01000401':'myEquation',
			'01000402':'equationDeposit',
			'01000403':'orderEquation',
			'01000404':'queryOrderEquation',
			'00000300':'00000300_customerInfoUpdate',
			'00000100':'003004_applicationForbidMenu',
			'00700003':'00700003_myCreditCardIntegral',
			'00700004':'00700004_myCreditCardApply',
			'00700601':'00700601_creditCardPlanTrack',
			'00701301':'00701301_quickHandRepayment',
			'00701001':'00701001_quickCreditCardActivate',
			'00700006':'00700006_quickMyCreditCardBill',
			'00600100':'00600100_helpAndLoan',
			'00700301':'00700301_emergeBillForQ',
			'00700201':'00700201_noEmergeBillForQ',
			'00300101':'00300101_quickExternalTransfer',
			'00300102':'00300102_quickExternalTransferTrueTime',
			'00200300':'00200300_quickCToCTransfer',
			'01110000':'01110000_myQueryProtocolManage',
			'01120000':'01120000_myPayProtocolManage',
			'00510000':'00510000_safeSettings',
			'00600001':'repaymentPlanQuery',
			'00600002':'iRepaymentDetailList',
			'00600003':'loadAccountDetail',
			'00000301':'00000301_customerInfoIndex',
			'00000302':'00000302_userIconSetting',
			'01000700':'lilac_MyLilacnewPage',
			'00900400':'per_myGovermentLoan',
			'01100101':'01100101_intout_Account_input',
			'00400003':'00400003_accountDebitTranDetailIndex'
		},
		//协议类型
		PRO_PAYTYPE: {
			'01': '在线认证请求',
			'02': 'URL请求'
		},
		//支付协议的业务种类
		Bus_TYPE:{
			'02001':'汇兑',
		    '02002':'理财股票类',
		    '02003':'理财基金类',
		    '02004':'理财保险类',
		    '02005':'理财彩票类',
		    '02006':'理财黄金类',
		    '02007':'理财债券类',
		    '02008':'理财其他类',
		    '02009':'网络购物服装类',
		    '02010':'网络购物饰品类',
		    '02011':'网络购物家居类',
			'02012':'网络购物生活类',
			'02013':'网络购物食品类',
			'02014':'网络购物虚拟类',
			'02015':'网络购物机票类',
			'02016':'网络购物旅游类',
			'02017':'网络购物美容类',
			'02018':'网络购物数码类',
			'02019':'网络购物电器类',
			'02020':'网络购物文体类',
			'02021':'商旅服务酒店类',
		    '02022':'商旅服务机票类',
		    '02023':'商旅服务其他类',
		    '00100':'电费',
		    '00200':'水暖费',
		    '00300':'煤气费',
		    '00400':'电话费',
		    '00500':'通讯费',
		    '00600':'保险费',
		    '00700':'房屋管理费',
		    '00800':'代理服务费',
		    '00900':'学教费',
		    '01000':'有线电视费',
		    '01100':'企业管理费用',
		    '01200':'薪金报酬',
		    '02024':'慈善捐款',
		    '02025':'贷款还款房贷类',
		    '02026':'贷款还款车贷类',
		    '02027':'预授权结算',
		    '09001':'其他'
		},

		//性别匹配
        Gender_Code:{
			'0' :　'男',
			'1' : '女'
		},

		//性别匹配(基金)
        Gender_Fund_Code:{
			'0' :　'女',
			'1' : '男'
		},

		//个人年收入匹配
		Per_Income_Code: {
			'01':'2万以下',
			'02':'2万-5万',
			'03':'5万-10万',
			'04':'10万-20万',
			'05':'20万-50万',
			'06':'50万-100万',
			'07' : '100万以上'
		},

		//家庭年收入匹配
		Family_Incm_Code: {
			'0':'5万以下',
			'1':'5万-10万',
			'2':'10万-20万',
			'3':'20万-50万',
			'4':'50万-100万',
			'5':'100万-200万',
			'6':'200万以上'
		},

		//住房情况匹配
		HouseStat_Code: {
			'01':'自置无安揭',
			'02':'自置有安揭',
			'03':'与父母同住',
			'04':'租用',
			'05':'员工宿舍',
			'06':'其他'

		},
	 //#购车情况匹配
		GetCar_State_Code: {
			'0':'未购车',
			'1':'自置无按揭',
			'2':'自置有按揭',
			'9':'其它'
		},

		 //#是否持有股票匹配
		STOCK_State_Code: {
			'0':'否',
			'1':'是'
		},

		 //#是否持有基金匹配
		FUND_State_Code: {
			'0':'否',
			'1':'是'
		},

		//#是否买过我行理财产品
		BUYLILAC_State_Code: {
			'0':'否',
			'1':'是'
		},

		//#投资目的
		INVESTAIM_State_Code: {
			'0':'保值',
			'1':'增值' ,
			'2':'无特别目的'
		},

		//#投资预期
		INVESTWANT_State_Code: {
			'0':'低于同期存款收益率',
			'1':'相当于同期存款收益率' ,
			'2':'高于同期存款收益率',
			'3':'远高于同期存款收益率'
		},

		//#月薪匹配
		Salary_Code: {
			'01':'五千以下',
			'02':'五千到一万',
			'03':'一万到两万',
			'04':'两万到五万',
			'05':'五万到二十万',
			'06':'二十万以上'
		},


		//#单位性质匹配
		UnitNatr_State_Code: {
			'0':'民营',
			'1':'国企',
			'2':'私企'
		},

		//应用开关状态
		Application_State: {
			'1':'已开通',
			'2':'已关闭'
		},

		//应用开关操作
		Application_State_Operate: {
			'1':'开通',
			'2':'关闭'
		},
		//服务类型
		ServiceType: {
			'1':'短信服务',
			'2':'邮件服务'
		},
		//交易类型
		TransactionType: {
			'64':'账户联机充值',
			'65':'账户联机消费',
			'66':'账户圈存消费',
			'67':'账户预授权',
			'68':'账户预授权消费',
			'69':'交易撤销',
			'70':'账户联机消费退货',
			'71':'账户开户',
			'72':'账户销户',
			'73':'账户挂失',
			'74':'账户解挂',
			'75':'账户更换',
			'76':'账户冻结',
			'77':'账户解冻',
			'78':'扣年费交易',
			'79':'扣手续费',
			'80':'账户逾期扣款',
			'81':'刮刮卡账户充值',
			'82':'积分账户充值',
			'83':'福彩兑奖账户充值',
			'84':'银行卡账户充值'
		},
		//业务种类
		Business_Type: {
			'10101':'个人结算业务',
			'10103':'外币结算业务',
			'10200':'定活两便业务',
			'10300':'整取整取业务',
			'10500':'零存整取业务',
			'10600':'教育储蓄业务',
			'10700':'存本取息业务',
			'10800':'通知存款业务',
			'10803':'理财方程式业务',
			'10804':'非常7+1帐户管理计划',
			'10805':'丁香花惠融理财',
			'20101':'理财产品业务'
		},


		//提醒业务状态
		Remind_State: {
			'0':'未查看',
			'1':'已查看',
			'2':'已忽略'
		},

		//债券发行方式
		productMode_Type: {
			'1':'按网点分配额度',
			'2':'全行竞售' ,
			'3':'分级共享额度'
		},
		//产品类型
		 product_Type: {
			'B01':'国债',
			'B04':'丁香花',
			'B07':'丁香花惠融'
		},

		//贷款查询类型
		 loanQuery_Type: {
			'WEB001':'查询贷款详细信息',
			'WEB002':'查询贷款还款明细',
			'WEB004':'查询还款计划' ,
			'WEB005':'查询助学贷款信息'
		},


		//存款产品代码
		 TerminalProductID_Type: {
			 '1010001':'活期储蓄存款',
			 '1020001':'活期存款',
			 '1020002':'个人委托存款',
			 '1090001':'内部帐活期产品',
			 '2010001':'工业存款',
			 '2010002':'商业存款',
			 '2010003':'建筑企业存款',
			 '2010004':'农业存款',
			 '2010005':'城镇集体企业存款',
			 '2010006':'乡镇企业存款',
			 '2010007':'三资企业存款',
			 '2010008':'私营企业及个体户存款',
			 '2010009':'其他企业存款',
			 '2010010':'保险公司存款',
			 '2010011':'行政事业单位存款',
			 '2010012':'单位其他存款',
			 '2011001':'同业清算存款',
			 '2011002':'同业一般存款',
			 '2012001':'财政预算存款',
			 '2012002':'财政预算外存款',
			 '2012003':'地方财政库款',
			 '2012004':'待结算财政款项',
			 '2090001':'对公活期承兑保证金',
			 '2090002':'对公活期担保保证金',
			 '2090003':'对公活期信用证保证金',
			 '2090005':'对公活期保函保证金',
			 '2090006':'对公活期其他保证金',
			 '3010001':'委托存款',
			 '1030001':'对私定活两便存款（93年以后）',
			 '1030002':'对私定活两便存款（93年以前）',
			 '1040001':'定期存款',
			 '1050001':'对私零存整取存款',
			 '1050003':'对私教育储蓄存款',
			 '1060001':'对私整存零取存款',
			 '1070001':'对私存本取息存款',
			 '1080001':'对私通知存款（新）',
			 '1080002':'对私通知存款（旧）',
			 '1080003':'理财方程式',
			 '2040001':'对公定期整存整取存款',
			 '2050001':'单位通知存款',
			 '2091001':'对公定期承兑保证金',
			 '2091002':'对公定期担保保证金',
			 '2091003':'对公定期信用证保证金',
			 '2091005':'对公定期保函保证金',
			 '2091006':'对公定期其他保证金',
			 '3001111':'私营及个体短期信用贷款',
			 '3001112':'私营及个体短期保证贷款',
			 '3001113':'私营及个体短期抵押质押贷',
			 '3001114':'其他中长期信用贷款',
			 '3001115':'其他中长期保证贷款',
			 '3001119':'其他中长期抵押质押贷款',
			 '3001131':'个人短期旅游贷款',
			 '3001132':'个人中长期旅游贷款',
			 '3001133':'个人短期住房装修贷款',
			 '3001134':'个人中长期住房装修贷款',
			 '3001139':'个人委托贷款',
			 '3001141':'短期耐用品消费贷款',
			 '3001142':'中长期耐用品消费贷款',
			 '3001148':'短期下岗失业人员小额担保贷款',
			 '3001149':'中长期下岗失业人员小额担保贷款',
			 '3001151':'私营及个体短期信用贷款',
			 '3001152':'私营及个体短期保证贷款',
			 '3001153':'私营及个体短期抵押质押贷',
			 '3001154':'其他中长期信用贷款',
			 '3001155':'其他中长期保证贷款',
			 '3001159':'其他中长期抵押质押贷款',
			 '3001161':'短期信用创业贷款',
			 '3001162':'短期保证创业贷款',
			 '3001163':'短期抵押创业贷款',
			 '3001164':'中长期信用创业贷款',
			 '3001165':'中长期保证创业贷款',
			 '3001169':'中长期抵押创业贷款',
			 '3001201':'短期个人消费贷款',
			 '3001203':'短期个人汽车贷款',
			 '3001206':'短期员工个人贷款',
			 '3001301':'中长期个人消费贷款',
			 '3001302':'中长期公积金住房贷款',
			 '3001303':'中长期个人汽车贷款',
			 '3001304':'中长期就学地助学保证贷款',
			 '3001306':'中长期员工个人贷款',
			 '3002001':'工业短期信用贷款',
			 '3002002':'商业短期信用贷款',
			 '3002003':'建筑业短期信用贷款',
			 '3002004':'农业短期信用贷款',
			 '3002005':'乡镇企业短期信用贷款',
			 '3002006':'三资企业短期信用贷款',
			 '3002007':'私营及个体短期信用贷款',
			 '3002008':'其它短期信用贷款',
			 '3002101':'工业短期保证贷款',
			 '3002102':'商业短期保证贷款',
			 '3002103':'建筑业短期保证贷款',
			 '3002104':'农业短期保证贷款',
			 '3002105':'乡镇企业短期保证贷款',
			 '3002106':'三资企业短期保证贷款',
			 '3002107':'私营及个体短期保证贷款',
			 '3002108':'其他短期保证贷款',
			 '3002201':'工业短期抵押质押贷款',
			 '3002202':'商业短期抵押质押贷款',
			 '3002203':'建筑业短期抵押质押贷款',
			 '3002204':'农业短期抵押质押贷款',
			 '3002205':'乡镇企业短期抵押质押贷',
			 '3002206':'三资企业短期抵押质押贷',
			 '3002207':'私营及个体短期抵押质押贷',
			 '3002208':'其他短期抵押质押贷款',
			 '3003001':'技术改造信用贷款（中长期）',
			 '3003002':'基本建设信用贷款（中长期）',
			 '3003003':'银团联合信用贷款（中长期）',
			 '3003004':'中期流动资金信用贷款（中长期）',
			 '3003010':'其他中长期信用贷款',
			 '3003101':'技术改造保证贷款（中长期）',
			 '3003102':'基本建设保证贷款（中长期）',
			 '3003103':'银团联合保证贷款（中长期）',
			 '3003104':'中长期流动资金保证贷款',
			 '3003110':'其他中长期保证贷款',
			 '3003201':'技术改造抵押质押贷款（中长期）',
			 '3003202':'基本建设抵押质押贷款（中长期）',
			 '3003203':'银团联合抵押质押贷款（中长期）',
			 '3003204':'中长期流动资金抵质押贷',
			 '3003210':'其他中长期抵押质押贷款',
			 '3004001':'承兑汇票贴现',
			 '3004002':'承兑汇票贴现(转贴)',
			 '3005003':'出口托收押汇',
			 '3005005':'进口托收押汇',
			 '3006001':'保函垫款',
			 '3006002':'承兑垫款',
			 '3006003':'信用证垫款',
			 '3006004':'个人信用卡垫款',
			 '3006005':'单位信用卡垫款',
			 '3006010':'其它垫款',
			 '3009001':'委托贷款',
			 '3013001':'技术改造信用贷款（中长期）',
			 '3013002':'基本建设信用贷款（中长期）',
			 '3013003':'银团联合信用贷款（中长期）',
			 '3013004':'中期流动资金信用贷款（中长期）',
			 '3013010':'其他中长期信用贷款',
			 '3013101':'技术改造保证贷款（中长期）',
			 '3013102':'基本建设保证贷款（中长期）',
			 '3013103':'银团联合保证贷款（中长期）',
			 '3013104':'中长期流动资金保证贷款',
			 '3013110':'其他中长期保证贷款',
			 '3013201':'技术改造抵押质押贷款（中长期）',
			 '3013202':'基本建设抵押质押贷款（中长期）',
			 '3013203':'银团联合抵押质押贷款（中长期）',
			 '3013204':'中长期流动资金抵质押贷',
			 '3013210':'其他中长期抵押质押贷款',
			 '3023003':'银团联合信用银团贷款',
			 '3023103':'银团联合保证银团贷款',
			 '3023203':'银团联合抵押质押银团贷款',
			 '3032001':'工业短期信用打包贷款',
			 '3052201':'工业短期仓单质押贷款',
			 '3052202':'商业短期仓单质押贷款',
			 '3052203':'建筑业短期仓单质押贷款',
			 '3052204':'农业短期仓单质押贷款',
			 '3052205':'乡镇企业短期仓单质押贷款',
			 '3052206':'三资企业短期仓单质押贷款',
			 '3052207':'私营企业及个体短期仓单质押贷款',
			 '3052208':'其他短期仓单质押贷款',
			 '3053201':'技术改造仓单质押贷款',
			 '3053202':'基本建设仓单质押贷款',
			 '3053203':'银团联合仓单质押贷款',
			 '3053204':'中期流动资金仓单质押贷款',
			 '3053210':'其他中长期仓单质押贷款',
			 '3062201':'工业短期出口退税帐户托管贷款',
			 '3062202':'商业短期出口退税帐户托管贷款',
			 '3062203':'建筑业短期出口退税帐户托管贷款',
			 '3062204':'农业短期出口退税帐户托管贷款',
			 '3062205':'乡镇企业短期出口退税帐户托管贷款',
			 '3062206':'三资企业短期出口退税帐户托管贷款',
			 '3062207':'私营企业及个体短期出口退税帐户托管',
			 '3062208':'其他短期出口退税帐户托管贷款',
			 '3100001':'投标保函',
			 '3100002':'工程承包',
			 '3100003':'履约保函',
			 '3100004':'预收款退款保函',
			 '3100005':'工程维修保函',
			 '3100006':'质量保函',
			 '3100007':'借款保函',
			 '3100008':'其他保函',
			 '3100020':'贷款承诺',
			 '3100040':'国外保函',
			 '3100041':'备用信用证',
			 '3152201':'工业短期存单等有价证券质押贷款',
			 '3152202':'商业短期存单等有价证券质押贷款',
			 '3152203':'建筑业短期存单等有价证券质押贷款',
			 '3152204':'农业短期存单等有价证券质押贷款',
			 '3152205':'乡镇企业短期存单等有价证券质押贷款',
			 '3152206':'三资企业短期存单等有价证券质押贷款',
			 '3152207':'私营企业及个体短期存单等有价证券质',
			 '3152208':'其他短期存单等有价证券质押贷款',
			 '3153201':'技术改造存单等有价证券质押贷款',
			 '3153202':'基本建设存单等有价证券质押贷款',
			 '3153203':'银团联合存单等有价证券质押贷款',
			 '3153204':'中期流动资金存单等有价证券质押贷款',
			 '3153210':'其他中长期存单等有价证券质押贷款',
			 '3162101':'工业短期保证财力贷款',
			 '3162102':'商业短期保证财力贷款',
			 '3162103':'建筑业短期保证财力贷款',
			 '3162104':'农业短期保证财力贷款',
			 '3162105':'乡镇企业短期保证财力贷款',
			 '3162106':'三资企业短期保证财力贷款',
			 '3162107':'私营企业及个体短期保证财力贷款',
			 '3162108':'其他短期保证财力贷款',
			 '3163101':'技术改造保证财力贷款',
			 '3163102':'基本建设保证财力贷款',
			 '3163103':'银团联合保证财力贷款',
			 '3163104':'中期财力保证贷款',
			 '3163110':'其他中长期保证财力贷款',
			 '3172308':'其它短期信用贷款',
			 '3172408':'其他短期保证贷款',
			 '3172508':'其他短期抵押质押贷款',
			 '3172602':'基本建设信用贷款（中长期）',
			 '3172610':'其他中长期信用贷款',
			 '3172702':'基本建设保证贷款（中长期）',
			 '3172704':'中长期流动资金保证贷',
			 '3172710':'其他中长期保证贷款',
			 '3172802':'基本建设抵押质押贷款（中长期）',
			 '3172810':'其他中长期抵押质押贷款',
			 '1997010301':'1997年一期三年期国债',
			 '1998010301':'1998年一期三年期国债',
			 '1998010501':'1998年一期五年期国债',
			 '1998020301':'1998年二期三年期国债',
			 '1998020501':'1998年二期五年期国债',
			 '1998030501':'1998年三期五年期国债',
			 '1999010301':'1999年一期三年期国债',
			 '1999010501':'1999年一期五年期国债',
			 '1999020301':'1999年二期三年期国债',
			 '1999020501':'1999年二期五年期国债',
			 '2000010301':'2000年一期三年期国债',
			 '2000010501':'2000年一期五年期国债',
			 '2000020201':'2000年二期二年期国债',
			 '2000020301':'2000年二期三年期国债',
			 '2000020501':'2000年二期五年期国债',
			 '2000030301':'2000年三期三年期国债',
			 '2000030501':'2000年三期五年期国债',
			 '2001010301':'2001年一期三年期国债',
			 '2001010501':'2001年一期五年期国债',
			 '2001020301':'2001年二期三年期国债',
			 '2001020501':'2001年二期五年期国债',
			 '2001030301':'2001年三期三年期国债',
			 '2001030501':'2001年三期五年期国债',
			 '2002010301':'2002年一期三年期国债',
			 '2002010501':'2002年一期五年期国债',
			 '2002020301':'2002年二期三年期国债',
			 '2002020501':'2002年二期五年期国债',
			 '2002030301':'2002年三期三年期国债',
			 '2002030501':'2002年三期五年期国债',
			 '2002040301':'2002年四期三年期国债',
			 '2002040501':'2002年四期五年期国债',
			 '2003010301':'2003年一期三年期国债',
			 '2003010501':'2003年一期五年期国债',
			 '2003020301':'2003年二期三年期国债',
			 '2003020501':'2003年二期五年期国债',
			 '2003030301':'2003年三期三年期国债',
			 '2003030501':'2003年三期五年期国债',
			 '2004010301':'2004年一期三年期国债',
			 '2004010501':'2004年一期五年期国债',
			 '2004020301':'2004年二期三年期国债',
			 '2004020501':'2004年二期五年期国债',
			 '2004040301':'2004年四期三年期国债',
			 '2004040501':'2004年四期五年期国债',
			 '2004060301':'2004年六期三年期国债',
			 '2004060501':'2004年六期五年期国债',
			 '2005010301':'2005年一期三年期国债',
			 '2005010501':'2005年一期五年期国债',
			 '2005020301':'2005年二期三年期国债',
			 '2005020501':'2005年二期五年期国债',
			 '2005030301':'2005年三期三年期国债',
			 '2005030501':'2005年三期五年期国债',
			 '2005040301':'2005年四期三年期国债',
			 '2005040501':'2005年四期五年期国债',
			 '2005050301':'2005年五期三年期国债',
			 '2005050501':'2005年五期五年期国债',
			 '2006010301':'2006年一期三年期国债',
			 '2006010501':'2006年一期五年期国债',
			 '2006020301':'2006年二期三年期国债',
			 '2006020501':'2006年二期五年期国债',
			 '2006030301':'2006年三期三年期国债',
			 '2006030501':'2006年三期五年期国债',
			 '2006040301':'2006年四期三年期国债',
			 '2006040501':'2006年四期五年期国债',
			 '2006050301':'2006年五期三年期国债',
			 '2006050501':'2006年五期五年期国债',
			 '2007010301':'2007年一期三年期国债',
			 '2007010302':'2007年一期三年期国债(调息后)',
			 '2007010501':'2007年一期五年期国债',
			 '2007010502':'2007年一期五年期国债(调息后)',
			 '2007020301':'2007年二期三年期国债',
			 '2007020501':'2007年二期五年期国债',
			 '2007030301':'2007年三期三年期国债',
			 '2007030302':'2007年三期三年期国债(调息后)',
			 '2007030501':'2007年三期五年期国债',
			 '2007030502':'2007年三期五年期国债(调息后)',
			 '2007040301':'2007年四期三年期国债',
			 '2007040302':'2007年四期三年期国债(调息后)',
			 '2007040501':'2007年四期五年期国债',
			 '2007040502':'2007年四期五年期国债(调息后)',
			 '2007050301':'2007年五期三年期国债',
			 '2007050501':'2007年五期五年期国债',
			 '2008010301':'2008年一期三年期国债',
			 '2008010501':'2008年一期五年期国债',
			 '2008020301':'2008年二期三年期国债',
			 '2008020501':'2008年二期五年期国债',
			 '2008030301':'2008年三期三年期国债',
			 '2008030501':'2008年三期五年期国债',
			 'DXH07001':'2007丁香花理财1号',
			 'DXH07002':'2007丁香花理财2号',
			 'DXH07003':'2007丁香花理财2号2期',
			 'DXH07004':'哈尔滨市商业银行“丁香花理财”三号',
			 'DXH07005':'哈尔滨市商业银行“丁香花理财”三号2',
			 'DXH08001':'哈尔滨银行“丁香花理财”二号三期',
			 'DXH08002':'哈尔滨银行“丁香花理财”四号一期',
			 'DXH08003':'哈尔滨银行“丁香花理财”五号',
			 'DXH08004':'哈尔滨银行“丁香花理财”六号一期'
		},
		PAY_USE_TYPE:{
			'01':'贷款',
		    '02':'采购款',
		    '03':'工资',
		    '04':'借款',
		    '05':'往来款',
		    '06':'采购款',
		    '07':'还款',
		    '08':'差旅费',
		    '09':'保证金',
		    '10':'运费'
		},

		//付款人账户类型
		 intInAccount_Type: {
			'00':'AT01',
			'01':'AT02',
			'02':'AT01'
		},

		//交易类型
		TxnFlg_type:{
			'1':'无',
			'2':'定期开户',
			'3':'转账' ,
			'4':'定期销户'
		},

		//还款方式匹配
		repaymentTypeCode_type:{
			'01': '贷款本金',
			'02': '贷款本金',
			'03': '贷款本金',
			'04': '贷款本金',
			'10': '贷款利息',
			'11': '贷款利息',
			'20': '贷款利息',
			'21': '贷款利息',
			'51': '贷款复利',
			'52': '贷款复利',
			'53': '贷款罚息'
		},
		FEE_ITEM_ID:{
			'MXLT02': '联通缴费',
			'MDX002': '电信缴费',
			'MTV002': '有线缴费',
			'MYD002': '移动缴费',
			'MTT002': '铁通电话费',
			'MGA002': '燃气费',
			'MWT002': '水费',
			'MEL002': '电费'
		},
		//返回错误信息系统标志
		ERRCODE_SYS_FLAG:{

			 '002001': '核心',
			 '025001': '基金',
			 '017001': '卡前置',
			 '017002': '卡前置（贷记卡）',
			 '027001': '集团现金',
			 '010001': '国结',
			 '006002': '短信',
			 '003002': '超级网银',
			 '001001': 'ESB'

		},
		//协议类型1
		agreement_type_history:{

			 'MT00': '签约',
			 'MT02': '解约'

		},
		agreement_type:{

			 '1': '已签约',
			 '2': '已解约'

		},
		//协议类型2
		agreement_return_type:{

			 'PR00': '已转发',
			 'PR01': '待认证',
			 'PR02': '已付款',
			 'PR03': '已轧差',
			 'PR04': '已清算',
			 'PR05': '已成功',
			 'PR06': '待处理',
			 'PR07': '已处理',
			 'PR08': '已撤销',
			 'PR09': '已拒绝',
			 'PR10': '已确认'

		},
		//本行行号
		BANKNO:{

			 'inBankNo': '313261000018'

		},


		//贷款类型
		loanType_type_Code:{
			'1':'普通',
			'2':'按揭'
		},

		//贷款状态
		loanState_Code:{
			'01':'正常',
		    '02':'展期',
		    '04':'逾期',
		    '05':'呆滞',
		    '06':'呆账',
		    '07':'核销',
		    '08':'销户'
		},

		//销售渠道标志 按销售渠道： 所有渠道是0 ； 电子渠道是2； 柜面渠道是：1
		SaleChannel_Type:{
			'0':'所有渠道',
		    '1':'柜面渠道',
		    '2':'电子渠道'
		},


		//理财产品性质
		productKind_Code:{
			 '01': '保本浮动收益性质',
             '02': '非保本浮动收益性质',
             '03': '保证收益性质',
             '04': '非保证收益性质'
		},


		//客户性质
		CustomType_Code:{
			 '1': '个人',
             '2': '对公',
             '3': '金融'
		},
		//网银互联_账户类型
		agreement_account_type:{
			 '2': '本行账户',
             '1': '他行账户'
		},*/


		//用户身份
		ubpUserId:{
			 '0': '游客',
             '1': '会员',
             '2': 'VIP'
		},
		//用户年龄
		ubpUserAge:{
			 '0': '18岁',
             '1': '25岁',
             '2': '30岁',
             '3': '35岁',
             '4': '40岁',
             '5': '50岁'
		},
		//用户资产
		ubpUserAssets:{
			 '0': '千元',
             '1': '万元',
             '2': '十万元',
             '3':'百万元',
             '4':'千万元',
             '5':'亿万元'
		},
		//用户性别
		ubpUserGender:{
			 'M': '男性',
             'F': '女性'
		},
		//渠道
		ubpChannel:{
			'0100':'网银',
			'1100':'内管中心',
			'1101':'个人会员中心',
			'1102':'个人网上营业厅',
			'1105':'快捷服务区',
			'1201':'手机WAP版',
			'1301':'手机',
			'1701':'IPAD版网银',
			'2101':'IVR',
			'2102':'CSR',
			'2201':'移动柜员系统',
			'2301':'电视银行',
			'2401':'短信银行',
			'2501':'微信',
			'3101':'刷卡',
			'3102':'输卡号'
		},
		//入口
		ubpGatecode:{
			'00000001':'社交网站',
			'00000002':'直接访问',
			'00000003':'搜索引擎',
			'00000004':'广告流量',
			'00000005':'外部链接'
		},
		//浏览器
		ubpBroser:{
			'IE6':'IE6',
			'IE7+':'IE7+',
			'CHROME':'Chrome',
			'FIREFOX':'Firefox',
			'360':'360',
			'MAXTHON':'Maxthon',
			'SAFARI':'Safari'
		},
		//搜索引擎
		ubpSearchEngine:{
			'www.baidu.com':'百度',
			'www.google.com':'谷歌',
			'www.sogou.com':'搜狗',
			'www.bing.com':'Bing',
			'www.haosou.com':'好搜'
		},
		//标签分类
		tagClass:{
			'activeTag':'活跃度',
			'ageTag':'年龄',
			'assetsTag':'资产'
		},
		//PC位置
		1101:{
			'010002020101':'基金广告位1',
			'010002020102':'基金广告位2',
			'010002020103':'基金广告位3',
			'1':'首页快捷'
		},
		//Phone位置
		1201:{
			'010001020102':'首页理财',
			'1':'首页快捷'
		},
		//Weixin位置
		1301:{
			'010001020102':'群发',
			'1':'首页快捷'
		},

		getBusinessName: function( appValue ){
				var appValue = $.lily.busName[ appValue ];
				if(appValue==undefined||appValue=='undefined'){
					return appValue;
				}
				return appValue;
			},





		getSelect: function( appName, selectCode, filter, blankSelect ) {
			var html = "";
			var map = $.lily.param[ appName ];
			if ( !map ) {
				alert( "param: " + appName + " not defined!");
				return null;
			}
			if(blankSelect)
				html += "<option value=\"\">请选择</option>";

			for(var key in map){
				var value = map[key];
				if(filter) {
					if(filter.include(key))
						continue;
				}
				if ( selectCode && selectCode == $.trim(key) ) {
					html += "<option value=\""+key+"\" selected=\"selected\">"+value+"</option>";
				}
				else {
					html += "<option value=\""+key+"\" >"+value+"</option>";
				}
			}
			return html;
		},

		getDisplay: function( appName, appValue ){
			var map = $.lily.param[ appName ];
			if ( !map ) {
				//alert( "Liana.param: " + appName + " not defined!");
				return null;
			}
			appValue=$.trim(appValue);
			if(map[appValue]==undefined||map[appValue]=='undefined'){
				return appValue;
			}

			return map[appValue];
		},
		gaikuangGetDisplay: function( appName, appValue ){
			var map = $.lily.param[ appName ];
			if ( !map ) {
				//alert( "Liana.param: " + appName + " not defined!");
				return null;
			}
			appValue=$.trim(appValue);
			if(map[appValue]==undefined||map[appValue]=='undefined'){
				return "其它";
			}

			return map[appValue];
		},

		getDisplayName: function( appName ){
			var map = $.lily.param[ appName ];
			if ( !map ) {
				//alert( "Liana.param: " + appName + " not defined!");
				return null;
			}
			//appValue=$.trim(appValue);
			/*if(map[appValue]==undefined||map[appValue]=='undefined'){
				return appValue;
			}*/
			var appValue=new Array;
			$.each(map,function(index,element){
				appValue.push(element);
			});
			return appValue;
		},
		getDisplayindex: function( appName ){//返回json的Key
			var map = $.lily.param[ appName ];
			if ( !map ) {
				//alert( "Liana.param: " + appName + " not defined!");
				return null;
			}
			//appValue=$.trim(appValue);
			/*if(map[appValue]==undefined||map[appValue]=='undefined'){
				return appValue;
			}*/
			var appValue=new Array;
			$.each(map,function(index,element){
				appValue.push(index);
			});
			return appValue;
		},

		getLogInfoDisplay: function( bsnCode, logInfo, logData ){
			var logInfoResult = '';
			$($(logData).find('log')).each(function(index) {
				var businessCode=$(this).attr('businessCode');
				var logInformation=$(this).attr('logInformation');
				businessCode = $.trim(businessCode);
				if(businessCode == bsnCode){
					if((logInformation =='' || logInformation ==null) && (logInfo=='' || logInfo==null)){
						logInfoResult='';
					}else{
						if(logInfo=='' || logInfo==null){
							logInfoResult='';
						}else if(logInformation=='' || logInformation==null){
							logInfoResult=logInfo;
						}else{
								var logInformationFlog = logInformation.split("^^");
							    var logInfoFlog = logInfo.split("^^");

							    var len = logInfoFlog.length;
							    var len2 = logInformationFlog.length;
							    if(len == 1){
							    	if(logInfoFlog[0].indexOf("错误代码") != -1){
							    		return logInfoFlog[0];
									}
							    	if(len2 == 2 && logInformationFlog[1] == ''){
							    		logInfoResult = logInformationFlog[0] + logInfoFlog[0] + "；";
							    		return logInfoResult;
							    	}
							    }
							    if(len == len2){
							    	for(var i = 0;i < len;i++ ){

										if(logInformationFlog[i].indexOf("**") != -1){
											var logInformationFlogArr = logInformationFlog[i].split("**");
											logInformationFlog[i] = logInformationFlogArr[0];
											logInfoFlog[i]=$.lily.param.getDisplay(logInformationFlogArr[1],logInfoFlog[i]);
										}

										if(logInformationFlog[i].indexOf("${date}") != -1){
											var logInformationFlogArr = logInformationFlog[i].split("${date}");
											logInformationFlog[i] = logInformationFlogArr[0];
											if(logInfoFlog[i].indexOf("-") != -1){
												logInfoFlog[i]=logInfoFlog[i];
											}else{
												logInfoFlog[i]=$.lily.format.dataToDate(logInfoFlog[i]);
											}
										}

										if(logInformationFlog[i].indexOf("${amt}") != -1){
											var logInformationFlogArr = logInformationFlog[i].split("${amt}");
											logInformationFlog[i] = logInformationFlogArr[0];
											if(logInfoFlog[i].indexOf("-") != -1){
												logInfoFlog[i]=logInfoFlog[i];
											}else{
												logInfoFlog[i]=$.lily.format.toCashWithComma(logInfoFlog[i]);
											}
										}

										var flagTemp = logInformationFlog[i] + logInfoFlog[i];
										if(flagTemp != '' && flagTemp != null){
											flagTemp = flagTemp +　"；";
										}
										logInfoResult += flagTemp;
									}
							    }

							}
						}

					return logInfoResult;

					}
			});

			if(logInfoResult =='' && logInfo !='' && logInfo != null){
				logInfoResult = logInfo;
			}
			return logInfoResult;
		},



		translateSysFlag:function(errorCode){
			var errorTran=errorCode.substring(0,6);
			var errorList=$.lily.param[ 'ERRCODE_SYS_FLAG' ];

			for(var key in errorList){
				if(key==errorTran){
					var sys= $.lily.param.getDisplay('ERRCODE_SYS_FLAG',errorTran);

					return sys+'▪'+errorCode.substring(6);
				}

			}

			return errorCode;

		}

	});

})(jQuery)